app/views/messages/_message.html.erb

INSERT INTO `messages` (`content`, `room_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Dignissimos et nisi ipsum.', 17, 21, '2020-11-26 08:17:58.155515', '2020-11-26 08:17:58.155515')
---
      <div class="message-date">
        <%= l message.created_at %>