app/views/rooms/new.html.erb

SELECT `users`.* FROM `users`
---
          <option value="">チャットするユーザーを選択してください</option>
          <% User.where.not(id: current_user.id).each do |user| %>