app/controllers/friends_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @friends = User.where.not(id: current_user.id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
  def create
    @friend = User.find([:id])