app/controllers/messages_controller.rb

  def index
    require 'net/http'
    require 'uri'
    require 'json'

    @message = Message.new
    @rooms = current_user.rooms
    @messages = @room.messages.includes(:user).order(id: 'ASC')
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 3)
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 2 ORDER BY `messages`.`id` ASC

  def create
    @message = @room.messages.new(message_params)
    if @message.save
      @language = lang_data(@message.content)
      @translated_content = translate_to_japanese(@message.content) if @language != 'ja'
      @message.update(message_params)
      redirect_to room_messages_path(@room)
    else
      @messages = @room.messages.includes(:user)
---
INSERT INTO `messages` (`content`, `room_id`, `user_id`, `created_at`, `updated_at`) VALUES ('日本語以外は訳を表示します', 2, 1, '2021-01-19 02:32:16.780681', '2021-01-19 02:32:16.780681')
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1

  def set_room
    @room = Room.find(params[:room_id])
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1

  def move_to_index
    @rooms = current_user.rooms.ids
---
SELECT `rooms`.`id` FROM `rooms` INNER JOIN `room_users` ON `rooms`.`id` = `room_users`.`room_id` WHERE `room_users`.`user_id` = 1