app/controllers/rooms_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @friends = User.where.not(id: current_user.id)

INSERT INTO `rooms` (`name`, `created_at`, `updated_at`) VALUES ('Translate', '2021-01-19 02:16:11.024117', '2021-01-19 02:16:11.024117')
---
  def create
    @room = Room.new(room_params)
    if @room.save

SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 5 LIMIT 1
DELETE FROM `rooms` WHERE `rooms`.`id` = 5
---
  def destroy
    room = Room.find(params[:id])
    room.destroy

SELECT `room_users`.* FROM `room_users` WHERE `room_users`.`room_id` = 7
SELECT `private_room_users`.* FROM `private_room_users` WHERE `private_room_users`.`user_id` IN (1, NULL)
---
  def friend
    @friends = User.where.not(id: current_user.id)

    @belong_rooms = PrivateRoomUser.where(user_id: current_user.id)
    @rooms = PrivateRoomUser.where(user_id: @friends.ids)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `private_rooms` (`created_at`, `updated_at`) VALUES ('2021-01-19 05:09:39.148883', '2021-01-19 05:09:39.148883')
INSERT INTO `room_users` (`room_id`, `user_id`, `created_at`, `updated_at`) VALUES (12, 2, '2021-01-11 10:20:08.668447', '2021-01-11 10:20:08.668447')
INSERT INTO `rooms` (`name`, `created_at`, `updated_at`) VALUES ('おもち', '2021-01-11 10:20:08.656049', '2021-01-11 10:20:08.656049')
---
  def chat
    @friend = User.find(params[:id])
    @room = PrivateRoom.new(user_ids: [@friend.id, current_user.id])
    # @room = PrivateRoom.new(chat_room_params)
    if @room.save