app/controllers/users_controller.rb

UPDATE `users` SET `users`.`image` = 'unnamed.jpg', `users`.`updated_at` = '2021-01-08 05:26:15.949236' WHERE `users`.`id` = 4
---
  def update
    if current_user.update(user_params)